package com.neuedu;

import org.apache.hadoop.io.LongWritable;
import org.apache.hadoop.io.Text;
import org.apache.hadoop.mapreduce.Mapper;

import java.io.IOException;

public class FiveStepMapper extends Mapper<LongWritable,Text,Text,Text> {
    //输入：6#丁同	0.008290701427018436#李三:0.250;李文秀:0.500;老头子:0.125;霍元龙:0.125
    /*输出：<李三,6#丁同>
    <李文秀,6#丁同>
    <老头子,6#丁同>
    <霍元龙,6#丁同>
    -----------------
    <丁同,@0.008290701427018436>
    -----------------
    <丁同,#李三:0.250;李文秀:0.500;老头子:0.125;霍元龙:0.125>*/
    @Override
    protected void map(LongWritable key, Text value, Context context) throws IOException, InterruptedException {
//        String[] split = value.toString().split("\t");//[0]6#丁同  [1]0.008290701427018436#李三:0.250;李文秀:0.500;老头子:0.125;霍元龙:0.125
//        String name = split[0].split("#")[1];//丁同
//        String namevalue="#"+split[1].split("#")[1];//#李三:0.250;李文秀:0.500;老头子:0.125;霍元龙:0.125
//        String[] split1 = split[1].split("#");//[0]0.008290701427018436   [1]李三:0.250;李文秀:0.500;老头子:0.125;霍元龙:0.125
//        String[] split2 = split1[1].split(";");//李三:0.250
//        for(String str:split2){
//            String[] split3 = str.split(":");
//            context.write(new Text(split3[0]),new Text(split[0]));
//        }
//        context.write(new Text(name),new Text(namevalue));
//        context.write(new Text(name),new Text("@"+split1[0]));
        String[] split = value.toString().split("\\t+");
        String[] split1 = split[0].split("#");
        String mainPeople = split1[1];
        String[] split2 = split[1].split("#");

        //<一灯大师,#完颜萍:0.004662004662004662;小龙女:0.018648018648018648;尹克西:0.002331002331002331;尼摩星:0.006993006993006993;张无忌:0.004662004662004662;无色:0.002331002331002331;明月:0.002331002331002331;朱九真:0.004662004662004662;朱子柳:0.027972027972027972;朱长龄:0.002331002331002331;李莫愁:0.009324009324009324;杨康:0.006993006993006993;杨过:0.07692307692307693;柯镇恶:0.004662004662004662;梅超风:0.002331002331002331;樵子:0.02097902097902098;欧阳克:0.006993006993006993;武三娘:0.004662004662004662;武三通:0.030303030303030304;武修文:0.006993006993006993;武敦儒:0.004662004662004662;洪七公:0.023310023310023312;渔人:0.02564102564102564;潇湘子:0.002331002331002331;点苍渔隐:0.006993006993006993;王处一:0.004662004662004662;琴儿:0.002331002331002331;穆念慈:0.002331002331002331;老头子:0.002331002331002331;耶律燕:0.006993006993006993;耶律齐:0.011655011655011656;裘千丈:0.002331002331002331;裘千仞:0.030303030303030304;上官:0.002331002331002331;裘千尺:0.013986013986013986;觉远:0.002331002331002331;觉远大师:0.002331002331002331;说不得:0.002331002331002331;达尔巴:0.004662004662004662;郝大通:0.004662004662004662;郭芙:0.009324009324009324;郭襄:0.039627039627039624;郭靖:0.11655011655011654;金轮法王:0.009324009324009324;陆乘风:0.002331002331002331;陆无双:0.016317016317016316;霍都:0.006993006993006993;马钰:0.004662004662004662;鲁有脚:0.009324009324009324;黄药师:0.03263403263403263;黄蓉:0.16783216783216784;小沙弥:0.006993006993006993;丘处机:0.011655011655011656;乔寨主:0.002331002331002331;书生:0.03496503496503497;农夫:0.037296037296037296;华筝:0.002331002331002331;卫璧:0.004662004662004662;吕文德:0.002331002331002331;周伯通:0.06060606060606061;哑巴:0.002331002331002331;哑梢公:0.002331002331002331;大汉:0.002331002331002331;天竺僧:0.002331002331002331;天竺僧人:0.006993006993006993>
        context.write(new Text(mainPeople),new Text("#" + split2[1]));
        context.write(new Text(mainPeople),new Text("@" + split2[0]));

        String[] split3 = split2[1].split(";");
        //<完颜萍,1#一灯大师>
//<小龙女,1#一灯大师>
//        ...
//<天竺僧人,1#一灯大师>
        for(String string : split3)
        {
            String[] split4 = string.split(":");
            context.write(new Text(split4[0]),new Text(split[0]));
        }
    }
}
